#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-72f6GF2ayUqx7vGp

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_method.actions: Refreshing state... [id=agm-gcp9dahm4c-i57f4h-PUT]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
aws_lambda_function.github: Refreshing state... [id=lambda-github]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy.lambda_invoke: Refreshing state... [id=iam_for_lambda:terraform-20210707172511482600000001]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=handler]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-i57f4h-PUT]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=nn1sip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.invoke_github will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invoke_github"  {
      ~ id      = "3874920128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2021-07-12T19:36:38.867Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
-/+ resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2021-06-30T20:13:39Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/test" -> (known after apply)
      ~ id            = "nn1sip" -> (known after apply)
      ~ invoke_url    = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      + triggers      = {
          + "redeployment" = "2f9376786f1e9b6c14cfa22122913c8985413ada"
        } # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_invoke will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_invoke" {
        id     = "iam_for_lambda:terraform-20210707172511482600000001"
        name   = "terraform-20210707172511482600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2021-07-12T19:36:14.464+0000" -> (known after apply)
      ~ source_code_hash               = "BXZXJtVG4KF1DpBJ8KByHrLE8DPK+OC8iH8mb28ur5Q=" -> "jAjJ6Ic1AmqqygneauVtujg1ZmQme0+y/KKHw3+c5Wo="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "handler"
      ~ last_modified                  = "2021-07-12T19:35:54.286+0000" -> (known after apply)
      ~ source_code_hash               = "U52mKSmRI/jy6+0o+QkBjzIzifigNCdgRDZRUgHZtsc=" -> "uxXrChSRtW3ua5oeA+NGcUpzowj13RHZUBhM5+abaWA="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2021-07-12T19:36:07.714+0000" -> (known after apply)
      ~ source_code_hash               = "QHda55oAA61ZVGGpk4aRfXjxypcxwdGerz2/USX24zo=" -> "FE+bKYk/qSbVbsf0nlS1PqNqFBr070Z4vj9e9uVDx9U="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.github will be updated in-place
  ~ resource "aws_lambda_function" "github" {
        id                             = "lambda-github"
      ~ last_modified                  = "2021-07-12T19:36:00.908+0000" -> (known after apply)
      ~ source_code_hash               = "qxUztmBiFwNwF2FO5egVDJn5f/vj0aBRWnhPWV5wlMs=" -> "a54DTcj/T12gNSbBQehXOEbB9sAh+83qIgTBXKMS9Qk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url     = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2021-07-12T19:36:38.867Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @jlangy, Action: `pull_request`*